# Groupby

In [2]:
import pandas as pd
import numpy as np

In [6]:
data = {'Company':['Apple','Apple','Digging Data','Digging Data','Facebook','Facebook'],
       'Person':['Parkash','Ahsan','Anil','Kishor','Afreen','Salma'],
       'Sales':[20,12,34,14,23,30]}

In [7]:
df = pd.DataFrame(data)

In [8]:
df

        Company   Person  Sales
0         Apple  Parkash     20
1         Apple    Ahsan     12
2  Digging Data     Anil     34
3  Digging Data   Kishor     14
4      Facebook   Afreen     23
5      Facebook    Salma     30

In [15]:
grouped = df.groupby('Company')['Sales']

In [16]:
grouped.mean()

Company
Apple           16.0
Digging Data    24.0
Facebook        26.5
Name: Sales, dtype: float64

In [17]:
grouped.std()

Company
Apple            5.656854
Digging Data    14.142136
Facebook         4.949747
Name: Sales, dtype: float64

In [18]:
grouped.min()

Company
Apple           12
Digging Data    14
Facebook        23
Name: Sales, dtype: int64

In [19]:
grouped.max()

Company
Apple           20
Digging Data    34
Facebook        30
Name: Sales, dtype: int64

In [29]:
grouped.count()

Company
Apple           2
Digging Data    2
Facebook        2
Name: Sales, dtype: int64

In [21]:
df.shape

(6, 3)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Company    6 non-null object
Person     6 non-null object
Sales      6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [20]:
df

        Company   Person  Sales
0         Apple  Parkash     20
1         Apple    Ahsan     12
2  Digging Data     Anil     34
3  Digging Data   Kishor     14
4      Facebook   Afreen     23
5      Facebook    Salma     30

In [23]:
df.describe()

           Sales
count   6.000000
mean   22.166667
std     8.681398
min    12.000000
25%    15.500000
50%    21.500000
75%    28.250000
max    34.000000

In [26]:
grouped.describe().transpose()

Company      Apple  Digging Data   Facebook
count     2.000000      2.000000   2.000000
mean     16.000000     24.000000  26.500000
std       5.656854     14.142136   4.949747
min      12.000000     14.000000  23.000000
25%      14.000000     19.000000  24.750000
50%      16.000000     24.000000  26.500000
75%      18.000000     29.000000  28.250000
max      20.000000     34.000000  30.000000

In [27]:
df

        Company   Person  Sales
0         Apple  Parkash     20
1         Apple    Ahsan     12
2  Digging Data     Anil     34
3  Digging Data   Kishor     14
4      Facebook   Afreen     23
5      Facebook    Salma     30

In [28]:
df['Company'].value_counts()

Facebook        2
Digging Data    2
Apple           2
Name: Company, dtype: int64